{
    "answers":
    [
        {
            "checkFunction": "NeedRecovery",
            "clues": [
                {
                    "en": "",
                    "fr": ""
                }
            ]

        },
        {
            "checkFunction": "CheckTrigram",
            "clues": [
                {
                    "en": "Warning... It appears you are not familiar with charter 2354-C5 defining the good use of IT tools in Gov services: a trigram is composed of 3 letters, no more, no less. Hint: It is usually made of the first letter of the first name, followed by the first two letters of the last name.\nYou have a new try :",
                    "fr": "PROBLEME... Il semble que vous ne soyez pas familier avec la charte 2354-C5 définissant les bon usages des outils informatique des services de l'état : un trigramme est composé de 3 lettres, ni plus, ni moins. Astuce : Il est généralement composé de la première lettre du prénom, suivie des 2 premières lettres du nom de famille.\nVous avez une nouvelle chance : "
                }
            ]
        },
        {
            "checkFunction": "CheckUser",
            "clues": [
                {
                    "en": "The user #>V:Trigram#-adm hasn't been found. Are you sure you've created it with the correct name?",
                    "fr": "L'utilisateur #>V:Trigram#-adm n'a pas été trouvé. Êtes-vous sûr de l'avoir créé avec le bon nom ?"
                },
                {
                    "en": "The authorization policy #>V:Trigram#-auth is not created as requested. Are you sure you've created it with the correct name?",
                    "fr": "La politique d'authorisation #>V:Trigram#-auth est absente. L'avez vous créée avec le bon nom ?"
                },
                {
                    "en": "The authorization policy #>V:Trigram#-auth exist, but is not correctly assigning the role to the user. Are you sure you've assigned the correct ressources?",
                    "fr": "La politique d'authorisation #>V:Trigram#-auth existe, mais n'assigne pas correctement le rôle à l'utilisateur. Êtes-vous sûr d'avoir assigné les bonnes ressources ?"
                }
                
            ]
        },
        {
            "checkFunction": "CheckProject",
            "clues": [
                {
                    "en": "The project #>V:Trigram#-proj doesn't exist. Are you sure you named it correctly?",
                    "fr": "Le projet #>V:Trigram#-proj n'existe pas. Êtes-vous sûr de l'avoir nommé correctement ?"
                },
                {
                    "en": "The project #>V:Trigram#-proj doesn't have any cluster associated. Can you fix it ?",
                    "fr": "Le projet #>V:Trigram#-proj n'a pas de cluster associé. Pouvez-vous le corriger ?"
                },
                {
                    "en": "The project #>V:Trigram#-proj doesn't have any user associated. Can you fix it ?",
                    "fr": "Le projet #>V:Trigram#-proj n'a pas d'utilisateur associé. Pouvez-vous corriger ça ?"
                }                
            ]
        },
        {
            "checkFunction": "CheckNetwork",
            "clues": [
                {
                    "en": "The subnet #>V:Trigram#-subnet is not on the cluster. Are you sure you named it correctly?",
                    "fr": "Le réseau #>V:Trigram#-subnet n'est pas sur le cluster. Êtes-vous sûr de l'avoir nommé correctement ?"
                },
                {
                    "en": "The subnet #>V:Trigram#-subnet is not correctly configured, is mode is 'Basic'. Can you fix it ?",
                    "fr": "Le réseau #>V:Trigram#-subnet n'est pas correctement configuré, son mode est 'Basic'. Pouvez-vous le passer en advanced ?"
                }               
            ]
        },
        {
            "checkFunction": "CheckImage",
            "clues": [
                {
                    "en": "Are you sure you created the image #>V:Trigram#-ubuntu ? I do not see it?",
                    "fr": "Êtes-vous sûr d'avoir créé l'image #>V:Trigram#-ubuntu ? Je ne la vois pas ?"
                }
            ]
        },
        {
            "checkFunction": "CheckVM",
            "clues": [
                {
                    "en": "The VM #>V:Trigram#-vm is not on the cluster. Are you sure you named it correctly?",
                    "fr": "La VM #>V:Trigram#-vm n'est pas sur le cluster. Êtes-vous sûr de l'avoir nommée correctement ?"
                },
                {
                    "en": "The VM #>V:Trigram#-vm should have 2 NICs. Are you sure you've configured it properly?",
                    "fr": "La VM #>V:Trigram#-vm devrait avoir 2 NICs. Êtes-vous sûr de l'avoir configurée correctement ?"
                },
                {
                    "en": "The VM #>V:Trigram#-vm should be connected to the network #>V:Trigram#-subnet. It looks like it is not done. Can you check ?",
                    "fr": "La VM #>V:Trigram#-vm devrait être connectée au réseau #>V:Trigram#-subnet. Il semble que ce ne soit pas le cas. Pouvez-vous vérifier ?"
                },
                {
                    "en": "The VM #>V:Trigram#-vm should be based on the image #>V:Trigram#-ubuntu. It seems not to be the case. Can you fix it ?",
                    "fr": "La VM #>V:Trigram#-vm devrait être basée sur l'image #>V:Trigram#-ubuntu. Il semble que ce ne soit pas le cas. Pouvez-vous corriger ça ?"
                },
                {
                    "en": "The VM #>V:Trigram#-vm should be in the project #>V:Trigram#-proj. It seems not to be the case. Can you fix it ?",
                    "fr": "La VM #>V:Trigram#-vm devrait être dans le projet #>V:Trigram#-proj. Il semble que ce ne soit pas le cas. Pouvez-vous corriger ça ?"
                },
                {
                    "en": "Your should have cloud-init configured. It seems not to be the case. Can you fix it or I won't able to connect on ? You'll have to recreate it, unfortunately.",
                    "fr": "Vous devriez avoir cloud-init configuré. Il semble que ce ne soit pas le cas. Pouvez-vous corriger ça ou je ne pourrai pas me connecter ? Vous devrez la recréer, malheureusement."
                },
                {
                    "en": "The VM #>V:Trigram#-vm is not powered on. Are you sure you started it?",
                    "fr": "La VM #>V:Trigram#-vm n'est pas allumée. Êtes-vous sûr de l'avoir démarrée ?"
                }                
            ]
        },
        {
            "checkFunction": "CheckCat",
            "clues": [
                {
                    "en": "The category #>V:Trigram#-cat doesn't exist. Are you sure you named it correctly?",
                    "fr": "La catégorie #>V:Trigram#-cat n'existe pas. Êtes-vous sûr de l'avoir nommée correctement ?"
                },
                {
                    "en": "The category #>V:Trigram#-cat exists, But I do not see the 'Test' value...",
                    "fr": "La catégorie #>V:Trigram#-cat existe, mais je ne vois pas la valeur 'Test'..."
                },
                {
                    "en": "The category #>V:Trigram#-cat exists, But I do not see the 'Critical' value...",
                    "fr": "La catégorie #>V:Trigram#-cat existe, mais je ne vois pas la valeur 'Critical'..."
                }
            ]
        },
        {
            "checkFunction": "CheckCatVM",
            "clues": [
                {
                    "en": "The VM #>V:Trigram#-vm is not associated to the category #>V:Trigram#-cat with value 'Critical'. Can you fix it ?",
                    "fr": "La VM #>V:Trigram#-vm n'est pas associée à la catégorie #>V:Trigram#-cat avec la valeur 'Critical'. Pouvez-vous corriger ça ?"
                }
            ]
        },
        {
            "checkFunction": "CheckStoragePolicy",
            "clues": [
                {
                    "en": "Are you sure you created the storage policy #>V:Trigram#-sto-policy ? I did not find it...",
                    "fr": "Etes-vous sûr d'avoir créé la storage policy #>V:Trigram#-sto-policy ? Je ne la trouve pas..."
                }
            ]
        },
        {
            "checkFunction": "CheckSecurityPolicy",
            "clues": [
                {
                    "en": "Are you sure you created the security policy #>V:Trigram#-mseg-policy ? I guess you should double check ;-) ?",
                    "fr": "Etes-vous sûr d'avoir créé la security policy #>V:Trigram#-mseg-policy ? Je pense que vous devriez vérifier ;-) ?"
                },
                {
                    "en": "The security policy is not associated to your category. Can you check ?",
                    "fr": "La security policy n'est pas associée à votre catégorie. Pouvez-vous vérifier ?"
                },
                {
                    "en": "The security policy is not in enforce mode. Can you change it ?",
                    "fr": "La security policy n'est pas en mode enforce. Pouvez-vous la changer ?"
                },
                {
                    "en": "The security policy seems not authorize all outbound protocols. Can you check ?",
                    "fr": "La security policy ne semble pas autoriser tous les protocoles sortants. Pouvez-vous vérifier ?"
                }

            ]
        },
        {
            "checkFunction": "CheckSecurityPolicy2",
            "clues": [
                {
                    "en": "Are you sure you created the security policy #>V:Trigram#-mseg-policy ? I guess you should double check ;-) ?",
                    "fr": "Etes-vous sûr d'avoir créé la security policy #>V:Trigram#-mseg-policy ? Je pense que vous devriez vérifier ;-) ?"
                },
                {
                    "en": "The security policy seems not authorize the ssh service. Can you check ?",
                    "fr": "La security policy ne semble pas autoriser le service ssh. Pouvez-vous vérifier ?"
                },
                {
                    "en": "The security policy seems not authorize the icmp service. Can you check ?",
                    "fr": "La security policy ne semble pas autoriser le service icmp. Pouvez-vous vérifier ?"
                }
            ]
        },
        {
            "checkFunction": "CheckProtectionPolicy",
            "clues": [
                {
                    "en": "Are you sure you created the protection policy #>V:Trigram#-prot-policy ? I did not find it?",
                    "fr": "Etes-vous sûr d'avoir créé la protection policy #>V:Trigram#-prot-policy ? Je ne la trouve pas ?"
                },
                {
                    "en": "It looks like the snapshot schedule is not set to 1 hour. Can you fix it ?",
                    "fr": "Il semble que le snapshot schedule ne soit pas configuré à 1 heure. Pouvez-vous le corriger ?"
                },
                {
                    "en": "It looks like the snapshot retention is not set to 1 day. Can you fix it ?",
                    "fr": "Il semble que la rétention des snapshots ne soit pas configurée à 1 jour. Pouvez-vous le corriger ?"
                },
                {
                    "en": "It looks like the category filter is not set correctly. Can you fix it ?",
                    "fr": "Il semble que le filtre de catégorie ne soit pas configuré correctement. Pouvez-vous le corriger ?"
                },
                {
                    "en": "It looks like the category value is not set correctly. Can you fix it ?",
                    "fr": "Il semble que la valeur de catégorie ne soit pas configurée correctement. Pouvez-vous le corriger ?"
                }
            ]
        },
        {
            "checkFunction": "CheckApprovalPolicy",
            "clues": [
                {
                    "en": "Are you sure you created the approval policy #>V:ApprovalPolicy#? I did not see it.",
                    "fr": "Etes-vous sûr d'avoir créé l'approval policy #>V:ApprovalPolicy# ? Je ne la vois pas."
                },
                {
                    "en": "The approval policy is not linked to the previous protection policy. Can you fix it ?",
                    "fr": "L'approval policy n'est pas liée à la protection policy précédente. Pouvez-vous corriger ça ?"
                }
            ]
        },
        {
            "checkFunction": "CheckRestoreVM",
            "clues": [
                {
                    "en": "The VM #>V:Trigram#-vm is not on the cluster. Are you sure you restored it correctly?",
                    "fr": "La VM #>V:Trigram#-vm n'est pas sur le cluster. Êtes-vous sûr de l'avoir restaurée sous le bon nom ?"
                },
                {
                    "en": "The VM #>V:Trigram#-vm is not started. Can you fix this?",
                    "fr": "La VM #>V:Trigram#-vm n'est pas démarrée. Vous pouvwz corriger le souci ?"
                }
            ]
        },
        {
            "checkFunction": "CheckLiveMigration",
            "clues": [
                {
                    "en": "The VM is still on the same host, move it right now please !",
                    "fr": "La VM est toujours sur le même hôte, déplacez-la immédiatement s'il vous plaît !"
                }
            ]
        },
        {
            "checkFunction": "CheckReport",
            "clues": [
                {
                    "en": "The report #>V:Trigram#-report is not on the cluster. Are you sure you named it correctly?",
                    "fr": "Le rapport #>V:Trigram#-report n'est pas sur le cluster. Êtes-vous sûr de l'avoir nommé correctement ?"
                },
                {
                    "en": "The report #>V:Trigram#-report should be scheduled daily. Can you fix it ?",
                    "fr": "Le rapport #>V:Trigram#-report devrait être planifié quotidiennement. Pouvez-vous corriger ça ?"
                },
                {
                    "en": "The report does not have te good recipient. Can you check that ?",
                    "fr": "Le rapport n'a pas le bon destinataire. Pouvez-vous vérifier ça ?"
                },
                {
                    "en": "The report #>V:Trigram#-report should just have a table with a list of all the VMs. Can you fix it ?",
                    "fr": "Le rapport #>V:Trigram#-report devrait simplement comporter un tableau avec la liste des VMs. Pouvez-vous corriger ça ?"
                }
            ]
        },
        {
            "checkFunction": "CheckNewNode",
            "clues": [
                {
                    "en": "I did not find the serial number of the new node. Can you check it ?",
                    "fr": "Je n'ai pas trouvé le numéro de série du nouveau noeud. Pouvez-vous vérifier ?"
                },
                {
                    "en": "This serial is really weird... Please double-check !",
                    "fr": "Ce numéro de série est vraiment bizarre... Merci de vérifier !"
                }
            ]
        },
        {
            "checkFunction": "CheckUpdates",
            "clues": [
                {
                    "en": "The number of updates is not the one expected. Can you double-check it ?",
                    "fr": "Le nombre de mises à jour n'est pas celui que je pensais. Pouvez-vous vérifier ?"
                },
                {
                    "en": "Hum, I need a number normally, I do not understand... ",
                    "fr": "Euh, il me faut un nombre normalement, je ne comprends pas... "
                }
            ]
        },
        {
            "checkFunction": "CheckRunway",
            "clues": [
                {
                    "en": "The runway is not the one expected. Can you verify it ? ",
                    "fr": "Le temps avant remplissage n'est pas celui que je pensais. Pouvez-vous vérifier ?"
                }
            ]
        },
        {
            "checkFunction": "CheckPlaybook",
            "clues": [
                {
                    "en": "The playbook #>V:Trigram#-playbook is not on the cluster. Are you sure you named it correctly?",
                    "fr": "Le playbook #>V:Trigram#-playbook n'est pas sur le cluster. Êtes-vous sûr de l'avoir nommé correctement ?"
                },
                {
                    "en": "Are you sure your trigger is correctly set ?",
                    "fr": "Etes-vous sûr que votre déclencheur est correctement configuré ?"
                },
                {
                    "en": "It is strange, actions are wrong. We need only one action which sends an email. Can you fix it ?",
                    "fr": "C'est étrange, les actions sont incorrectes. Nous avons besoin d'une seule action qui envoie un email. Pouvez-vous corriger ça ?"
                },
                {
                    "en": "The playbook is not enabled. Can you fix it ?",
                    "fr": "Le playbook n'est pas activé. Pouvez-vous corriger ça ?"
                }
            ]
        },
        {
            "checkFunction": "CheckCloneApp",
            "clues": [
                {
                    "en": "The app #>V:Trigram#-app is not on the cluster. Are you sure you named it correctly?",
                    "fr": "L'application #>V:Trigram#-app n'est pas sur le cluster. Êtes-vous sûr de l'avoir nommée correctement ?"
                },
                {
                    "en": "Automation has not created VPC #>V:Trigram#-vpc, that is weird. Can you check apps log in its audit panel? You can delete it and redeploy app if you used a bad vpc name.",
                    "fr": "L'automatisation n'a pas créé le VPC #>V:Trigram#-vpc, c'est bizarre. Pouvez-vous vérifier les logs de l'application dans son panneau d'audit ? Vous pouvez le supprimer et redéployer l'application si vous avez utilisé un mauvais nom de VPC."
                }
            ]
        },
        {
            "checkFunction": "CheckSchedDay2",
            "clues": [
                {
                    "en": "The schedule #>V:Trigram#-sched is not associated to the app. Can you fix it ?",
                    "fr": "Le schedule #>V:Trigram#-sched n'est pas associé à l'application. Pouvez-vous corriger ça ?"
                },
                {
                    "en": "You have created #>V:Trigram#-sched ?? It seems not to be the case... Can you check it ?",
                    "fr": "Vous avez créé le schedule #>V:Trigram#-sched ?? On ne dirait pas... Pouvez-vous corriger ça ?"
                }
                
            ]
        },
        {
            "checkFunction": "CheckUpdateBP",
            "clues": [
                {
                    "en": "The blueprint bp-blankvm-prd#>V:Vlanid# is not on the cluster. Have you changed his name?",
                    "fr": "Le blueprint bp-blankvm-prd#>V:Vlanid# n'est pas sur le cluster. Avez-vous changé son nom ?"
                },{
                    "en": "I do not see the 'foo' task in the create action of your VM, please check it.",
                    "fr": "Je ne vois pas la tâche 'foo' dans l'action de création de votre VM, merci de vérifier."
                }
            ]
        }           
    ]
}